# ЛАБОРАТОРНАЯ РАБОТА 3
## Тема: Программирование циклических алгоритмов. Операторы цикла
### Цель работы: изучить приемы составления циклических алгоритмов, правила использования операторов for, while, do – while.
**ЗАДАНИЕ 1. Использование оператора WHILE.**

Вычислить и вывести на экран в виде таблицы значения заданной
функции F от -1 до 1 с шагом 0.05. Значения аргументов функции a, b и c
вводятся с клавиатуры.

Предусмотреть сообщение об ошибке в случае исключительной
ситуации. Для ввода/вывода используйте библиотеку stdio.

```php
        if (a < 0 && x != 0)
        {
            F = a * pow(x, 2) + pow(b, 2) * x;
        }
        else if (a > 0 && x == 0 && (x - c) != 0)
        {
            F = x - a / (x - c);
        }
        else if (c != 0) {

            F = 1 + x / c;
        }
        else
        {
            printf("|    %.2lf    |    ----   |\n", x);
            x += step;
            continue;
        }
```
**ЗАДАНИЕ 2. Использование оператора for.**

Пользователь вводит число n (в диапазоне от 0 до 20). Сформировать
соответствующую фигуру из звездочек (символов *). Ваша фигура должна
быть вписана в квадрат n\*n символов.

На рисунке по вариантам показан пример для n=5 (фигура 5*5).

```
*****
 *
  *
   *
*****
```
**ЗАДАНИЕ 3.**

Напишите программу, которая выведет на экран таблицу с данными в виде: x,S(x),Y(x),|Y(x)-S(x)|

Значение аргумента x изменяется от a до b с шагом h.

Для каждого x рассчитать значения функции Y(x), сумму ряда S(x) и
модуль разницы | Y(x)-S(x )|.

Так как значение S(x) является рядом разложения функции Y(x), то
значения S и Y для текущего аргумента x должны совпадать в целой части (в
двух-четырех позициях после десятичной точки).

Значения переменных задать статически в коде: a = 0.1; b = 1.0; h = 0.1; n=20.

```php
        double sx = 0;
        for (double k = 0; k <= n; k++) 
        {
            double p = pow(x, 2 * k + 1) / factorial(2 * k + 1);
            sx += p;
        }
        double yx = (exp(x) - exp(-x)) / 2;
```
